[
    {
      "bookId": 1,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "great_gatsby.jpg",
      "review": "The Great Gatsby is a timeless classic that delves into the roaring twenties, capturing the essence of the era with its lavish parties, complex characters, and themes of love, ambition, and the American Dream. Fitzgerald's prose is rich and evocative, drawing readers into the opulent world of Jay Gatsby and his pursuit of Daisy Buchanan. The novel explores the disillusionment that accompanies the pursuit of wealth and status, making it a poignant commentary on the emptiness of materialism and the fragility of human aspirations.",
      "totalPages": 180,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Classic", "Romance", "Tragedy"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
    },
    {
      "bookId": 2,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "1984.jpg",
      "review": "1984 is a dystopian masterpiece that remains disturbingly relevant in today's world. Orwell's portrayal of a totalitarian society where individuality is suppressed and truth is manipulated is both chilling and thought-provoking. Through the protagonist Winston Smith, Orwell explores themes of surveillance, propaganda, and the erosion of freedom. The novel serves as a stark warning against the dangers of authoritarianism and the importance of preserving liberty and truth. Despite being written over 70 years ago, 1984 continues to resonate with readers as a powerful commentary on the human condition.",
      "totalPages": 328,
      "rating": 4.8,
      "category": "Science Fiction",
      "tags": ["Dystopian", "Political"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": 3,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "to_kill_a_mockingbird.jpg",
      "review": "To Kill a Mockingbird is a timeless classic that tackles issues of racism, injustice, and morality in the American South. Through the eyes of young Scout Finch, Harper Lee explores themes of empathy, compassion, and the search for truth. The novel's portrayal of Atticus Finch, a principled lawyer defending a black man wrongly accused of rape, serves as a powerful example of integrity and courage in the face of prejudice. With its poignant storytelling and memorable characters, To Kill a Mockingbird continues to inspire readers of all ages to confront injustice and uphold the values of equality and fairness.",
      "totalPages": 281,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Coming-of-age", "Social Justice"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
        "bookId": 4,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "pride_and_prejudice.jpg",
        "review": "Pride and Prejudice is a delightful comedy of manners that explores the complexities of love, marriage, and social hierarchy in Regency England. Jane Austen's sharp wit and keen observation are evident in her portrayal of the spirited Elizabeth Bennet and the enigmatic Mr. Darcy. The novel's timeless appeal lies in its witty dialogue, memorable characters, and timeless themes of love and self-discovery. As Elizabeth navigates the societal expectations of her time, she learns to overcome her own prejudices and find true happiness. Pride and Prejudice remains a beloved classic that continues to enchant readers with its charm and romance.",
        "totalPages": 279,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Romance", "Satire"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
      },
      {
        "bookId": 5,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "catcher_in_the_rye.jpg",
        "review": "The Catcher in the Rye is a provocative coming-of-age novel that has captivated readers for generations with its rebellious protagonist, Holden Caulfield. J.D. Salinger's exploration of teenage angst, alienation, and the search for identity resonates with readers of all ages. Through Holden's cynical yet vulnerable voice, Salinger exposes the hypocrisy and phoniness of adult society, offering a poignant critique of conformity and materialism. Despite its controversial themes and language, The Catcher in the Rye remains a powerful and enduring work of literature that continues to provoke thought and spark discussion.",
        "totalPages": 224,
        "rating": 4.4,
        "category": "Fiction",
        "tags": ["Coming-of-age", "Rebellion"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
      },
      {
        "bookId": 6,
        "bookName": "Harry Potter and the Sorcerer's Stone",
        "author": "J.K. Rowling",
        "image": "harry_potter_sorcerers_stone.jpg",
        "review": "Harry Potter and the Sorcerer's Stone is the enchanting first installment in J.K. Rowling's beloved fantasy series. With its magical world of Hogwarts, spells, and Quidditch, the novel transports readers to a realm of wonder and adventure. Through the journey of young Harry Potter, Rowling explores themes of friendship, courage, and the battle between good and evil. The novel's imaginative storytelling, endearing characters, and thrilling plot twists have captivated readers of all ages around the globe. Harry Potter and the Sorcerer's Stone is not just a book; it's a cultural phenomenon that continues to inspire and delight readers of all generations.",
        "totalPages": 309,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Magic", "Adventure"],
        "publisher": "Bloomsbury",
        "yearOfPublishing": 1997
      },
      {
        "bookId": 7,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "the_hobbit.jpg",
        "review": "The Hobbit is a timeless classic that transports readers to the enchanting world of Middle-earth, where adventure awaits at every turn. J.R.R. Tolkien's tale of Bilbo Baggins, a reluctant hobbit thrust into a grand quest to reclaim a lost kingdom, is filled with magic, danger, and camaraderie. Through Bilbo's journey, Tolkien explores themes of heroism, friendship, and the power of imagination. The novel's richly detailed world, vibrant characters, and epic storytelling have made it a beloved classic for readers of all ages. From encountering trolls and elves to facing the fearsome dragon Smaug, The Hobbit is an unforgettable adventure that continues to inspire generations of readers to embark on their own quests for discovery and courage.",
        "totalPages": 310,
        "rating": 4.7,
        "category": "Fantasy",
        "tags": ["Adventure", "Quest"],
        "publisher": "Allen & Unwin",
        "yearOfPublishing": 1937
      },
      {
        "bookId": 8,
        "bookName": "The Da Vinci Code",
        "author": "Dan Brown",
        "image": "da_vinci_code.jpg",
        "review": "The Da Vinci Code is a gripping thriller that combines art, history, and mystery into a thrilling adventure. Dan Brown's fast-paced narrative follows symbologist Robert Langdon as he unravels clues hidden in famous works of art, uncovering a centuries-old secret that could shake the foundations of Christianity. Filled with twists, turns, and shocking revelations, the novel keeps readers on the edge of their seats until the very end. With its blend of suspense, intrigue, and intellectual puzzles, The Da Vinci Code is a captivating read that challenges readers to question everything they thought they knew.",
        "totalPages": 454,
        "rating": 4.3,
        "category": "Thriller",
        "tags": ["Mystery", "Conspiracy"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2003
      },
      {
        "bookId": 9,
        "bookName": "The Hunger Games",
        "author": "Suzanne Collins",
        "image": "the_hunger_games.jpg",
        "review": "The Hunger Games is a gripping dystopian novel that immerses readers in a dark and dangerous world where survival is everything. Suzanne Collins' tale of Katniss Everdeen, a young girl forced to compete in a brutal televised fight to the death, is a powerful exploration of sacrifice, resilience, and the consequences of power. Set in a future society where the wealthy elite oppress the impoverished masses, the novel offers a scathing critique of inequality and injustice. With its compelling characters, adrenaline-fueled action, and thought-provoking themes, The Hunger Games is a must-read for fans of dystopian fiction.",
        "totalPages": 374,
        "rating": 4.6,
        "category": "Science Fiction",
        "tags": ["Dystopian", "Survival"],
        "publisher": "Scholastic Press",
        "yearOfPublishing": 2008
      }
]